#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/natebay-aws/aws-jenkins-build-server/runs/run-pifgqjVo5k86FS3C[0m
[0m
Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # aws_kms_key.efs_kms_key[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_kms_key" "efs_kms_key" {
      [32m+[0m [0m[1m[0marn[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mbypass_policy_lockout_safety_check[0m[0m = false
      [32m+[0m [0m[1m[0mcustomer_master_key_spec[0m[0m           = "SYMMETRIC_DEFAULT"
      [32m+[0m [0m[1m[0mdescription[0m[0m                        = "KMS key used to encrypt Jenkins EFS volume"
      [32m+[0m [0m[1m[0menable_key_rotation[0m[0m                = false
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mis_enabled[0m[0m                         = true
      [32m+[0m [0m[1m[0mkey_id[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mkey_usage[0m[0m                          = "ENCRYPT_DECRYPT"
      [32m+[0m [0m[1m[0mmulti_region[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = (known after apply)
    }

[1m  # module.acm.aws_acm_certificate.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_acm_certificate" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mdomain_name[0m[0m               = "jenkins-controller.natebayaws.cloud"
      [32m+[0m [0m[1m[0mdomain_validation_options[0m[0m = [
          [32m+[0m [0m{
              [32m+[0m [0mdomain_name           = "jenkins-controller.natebayaws.cloud"
              [32m+[0m [0mresource_record_name  = (known after apply)
              [32m+[0m [0mresource_record_type  = (known after apply)
              [32m+[0m [0mresource_record_value = (known after apply)
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0msubject_alternative_names[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                      = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                  = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mvalidation_emails[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mvalidation_method[0m[0m         = "DNS"

      [32m+[0m [0moptions {
          [32m+[0m [0m[1m[0mcertificate_transparency_logging_preference[0m[0m = "ENABLED"
        }
    }

[1m  # module.acm.aws_acm_certificate_validation.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_acm_certificate_validation" "this" {
      [32m+[0m [0m[1m[0mcertificate_arn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mvalidation_record_fqdns[0m[0m = (known after apply)
    }

[1m  # module.acm.aws_route53_record.validation[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_record" "validation" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = true
      [32m+[0m [0m[1m[0mfqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mrecords[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mttl[0m[0m             = 60
      [32m+[0m [0m[1m[0mtype[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "Z08283091JJ6X8ITV69S6"
    }

[1m  # module.serverless_jenkins.data.aws_iam_policy_document.efs_resource_policy[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "aws_iam_policy_document" "efs_resource_policy"  {
      [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mjson[0m[0m = (known after apply)

      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticfilesystem:ClientMount",
              [32m+[0m [0m"elasticfilesystem:ClientRootAccess",
              [32m+[0m [0m"elasticfilesystem:ClientWrite",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "Bool"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m"true",
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "aws:SecureTransport"
            }

          [32m+[0m [0mprincipals {
              [32m+[0m [0m[1m[0midentifiers[0m[0m = [
                  [32m+[0m [0m"arn:aws:iam::212329472425:root",
                ]
              [32m+[0m [0m[1m[0mtype[0m[0m        = "AWS"
            }
        }
    }

[1m  # module.serverless_jenkins.data.aws_iam_policy_document.jenkins_controller_task_policy[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "aws_iam_policy_document" "jenkins_controller_task_policy"  {
      [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mjson[0m[0m = (known after apply)

      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ecs:ListContainerInstances",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ecs:RunTask",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"arn:aws:ecs:us-west-2:212329472425:task-definition/*",
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "ArnEquals"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m(known after apply),
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "ecs:cluster"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ecs:DescribeTasks",
              [32m+[0m [0m"ecs:StopTask",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"arn:aws:ecs:us-west-2:212329472425:task/*",
            ]

          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mtest[0m[0m     = "ArnEquals"
              [32m+[0m [0m[1m[0mvalues[0m[0m   = [
                  [32m+[0m [0m(known after apply),
                ]
              [32m+[0m [0m[1m[0mvariable[0m[0m = "ecs:cluster"
            }
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ssm:GetParameter",
              [32m+[0m [0m"ssm:GetParameters",
              [32m+[0m [0m"ssm:PutParameter",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"arn:aws:ssm:us-west-2:212329472425:parameter/jenkins*",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"kms:Decrypt",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"arn:aws:kms:us-west-2:212329472425:alias/aws/ssm",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"iam:PassRole",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"arn:aws:iam::212329472425:role/*",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"logs:CreateLogStream",
              [32m+[0m [0m"logs:PutLogEvents",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"ecr:BatchCheckLayerAvailability",
              [32m+[0m [0m"ecr:BatchGetImage",
              [32m+[0m [0m"ecr:GetAuthorizationToken",
              [32m+[0m [0m"ecr:GetDownloadUrlForLayer",
              [32m+[0m [0m"ecs:DeregisterTaskDefinition",
              [32m+[0m [0m"ecs:DescribeContainerInstances",
              [32m+[0m [0m"ecs:DescribeTaskDefinition",
              [32m+[0m [0m"ecs:ListClusters",
              [32m+[0m [0m"ecs:ListTaskDefinitions",
              [32m+[0m [0m"ecs:RegisterTaskDefinition",
              [32m+[0m [0m"elasticfilesystem:ClientMount",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m"*",
            ]
        }
      [32m+[0m [0mstatement {
          [32m+[0m [0m[1m[0mactions[0m[0m   = [
              [32m+[0m [0m"elasticfilesystem:ClientRootAccess",
              [32m+[0m [0m"elasticfilesystem:ClientWrite",
            ]
          [32m+[0m [0m[1m[0meffect[0m[0m    = "Allow"
          [32m+[0m [0m[1m[0mresources[0m[0m = [
              [32m+[0m [0m(known after apply),
            ]
        }
    }

[1m  # module.serverless_jenkins.data.template_file.jenkins_configuration_def[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "template_file" "jenkins_configuration_def"  {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mrendered[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtemplate[0m[0m = <<-EOT
            jenkins:
                systemMessage: "Amazon Fargate Demo"
                numExecutors: 0
                remotingSecurity:
                  enabled: true
                agentProtocols:
                    - "JNLP4-connect"
                securityRealm:
                    local:
                        allowsSignup: false
                        users:
                            - id: ecsuser
                              password: \$${ADMIN_PWD}
                authorizationStrategy:
                    globalMatrix:
                        grantedPermissions:
                            - "Overall/Read:authenticated"
                            - "Job/Read:authenticated"
                            - "View/Read:authenticated"
                            - "Overall/Administer:authenticated"
                crumbIssuer: "standard"
                slaveAgentPort: 50000
                clouds:
                    # - ecs:
                    #       allowedOverrides: "inheritFrom,label,memory,cpu,image"
                    #       credentialsId: ""
                    #       cluster: ${ecs_cluster_fargate_spot}
                    #       name: "fargate-cloud-spot"
                    #       regionName: ${cluster_region}
                    #       retentionTimeout: 10
                    #       jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                    #       templates:
                    #           - cpu: "512"
                    #             image: "jenkins/inbound-agent"
                    #             label: "build-spot"
                    #             executionRole: ${execution_role_arn}
                    #             launchType: "FARGATE"
                    #             memory: 0
                    #             memoryReservation: 1024
                    #             networkMode: "awsvpc"
                    #             privileged: false
                    #             remoteFSRoot: "/home/jenkins"
                    #             securityGroups: ${agent_security_groups}
                    #             sharedMemorySize: 0
                    #             subnets: ${subnets}
                    #             templateName: "build"
                    #             uniqueRemoteFSRoot: false
                    - ecs:
                          allowedOverrides: "inheritFrom,label,memory,cpu,image"
                          credentialsId: ""
                          cluster: ${ecs_cluster_fargate}
                          name: "fargate-cloud"
                          regionName: ${cluster_region}
                          retentionTimeout: 10
                          jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                          templates:
                              - cpu: "512"
                                image: "jenkins/inbound-agent"
                                label: "build"
                                executionRole: ${execution_role_arn}
                                launchType: "FARGATE"
                                memory: 0
                                memoryReservation: 1024
                                networkMode: "awsvpc"
                                privileged: false
                                remoteFSRoot: "/home/jenkins"
                                securityGroups: ${agent_security_groups}
                                sharedMemorySize: 0
                                subnets: ${subnets}
                                templateName: "build"
                                uniqueRemoteFSRoot: false
            security:
              sSHD:
                port: -1
            jobs:
              - script: >
                  pipelineJob('Simple job critical task') {
                    definition {
                      cps {
                        script('''
                          pipeline {
                              agent {
                                  ecs {
                                      inheritFrom 'build'
                                  }
                              }
                              stages {
                                stage('Test') {
                                    steps {
                                        script {
                                            sh "echo this was executed on non spot instance"
                                        }
                                        sh 'sleep 120'
                                        sh 'echo sleep is done'
                                    }
                                }
                              }
                          }'''.stripIndent())
                          sandbox()
                      }
                    }
                  }
              # - script: >
              #     pipelineJob('Simple job non critical task') {
              #       definition {
              #         cps {
              #           script('''
              #             pipeline {
              #                 agent {
              #                     ecs {
              #                         inheritFrom 'build-spot'
              #                     }
              #                 }
              #                 stages {
              #                   stage('Test') {
              #                       steps {
              #                           script {
              #                               sh "echo this was executed on a spot instance"
              #                           }
              #                           sh 'sleep 120'
              #                           sh 'echo sleep is done'
              #                       }
              #                   }
              #                 }
              #             }'''.stripIndent())
              #             sandbox()
              #         }
              #       }
              #     }
        EOT
      [32m+[0m [0m[1m[0mvars[0m[0m     = {
          [32m+[0m [0m"agent_security_groups"   = (known after apply)
          [32m+[0m [0m"cluster_region"          = "us-west-2"
          [32m+[0m [0m"ecs_cluster_fargate"     = (known after apply)
          [32m+[0m [0m"execution_role_arn"      = (known after apply)
          [32m+[0m [0m"jenkins_cloud_map_name"  = "controller.serverless-jenkins"
          [32m+[0m [0m"jenkins_controller_port" = "8080"
          [32m+[0m [0m"jnlp_port"               = "50000"
          [32m+[0m [0m"subnets"                 = "subnet-082823527a66dfb03,subnet-01ead1fb0854f8abc"
        }
    }

[1m  # module.serverless_jenkins.aws_cloudwatch_log_group.jenkins_controller_log_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "jenkins_controller_log_group" {
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m              = "serverless-jenkins"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m = 14
      [32m+[0m [0m[1m[0mtags[0m[0m              = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m          = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
    }

[1m  # module.serverless_jenkins.aws_ecr_repository.jenkins_controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecr_repository" "jenkins_controller" {
      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mimage_tag_mutability[0m[0m = "MUTABLE"
      [32m+[0m [0m[1m[0mname[0m[0m                 = "serverless-jenkins-controller"
      [32m+[0m [0m[1m[0mregistry_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrepository_url[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m             = (known after apply)

      [32m+[0m [0mimage_scanning_configuration {
          [32m+[0m [0m[1m[0mscan_on_push[0m[0m = true
        }
    }

[1m  # module.serverless_jenkins.aws_ecr_repository_policy.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecr_repository_policy" "this" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m      = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"ecr:UploadLayerPart",
                          [32m+[0m [0m"ecr:SetRepositoryPolicy",
                          [32m+[0m [0m"ecr:PutImage",
                          [32m+[0m [0m"ecr:ListImages",
                          [32m+[0m [0m"ecr:InitiateLayerUpload",
                          [32m+[0m [0m"ecr:GetRepositoryPolicy",
                          [32m+[0m [0m"ecr:GetDownloadUrlForLayer",
                          [32m+[0m [0m"ecr:DescribeRepositories",
                          [32m+[0m [0m"ecr:DeleteRepositoryPolicy",
                          [32m+[0m [0m"ecr:DeleteRepository",
                          [32m+[0m [0m"ecr:CompleteLayerUpload",
                          [32m+[0m [0m"ecr:BatchGetImage",
                          [32m+[0m [0m"ecr:BatchDeleteImage",
                          [32m+[0m [0m"ecr:BatchCheckLayerAvailability",
                        ]
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mAWS = "arn:aws:iam::212329472425:root"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mregistry_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrepository[0m[0m  = "serverless-jenkins-controller"
    }

[1m  # module.serverless_jenkins.aws_ecs_cluster.jenkins_controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecs_cluster" "jenkins_controller" {
      [32m+[0m [0m[1m[0marn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mcapacity_providers[0m[0m = [
          [32m+[0m [0m"FARGATE",
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "serverless-jenkins-main"
      [32m+[0m [0m[1m[0mtags[0m[0m               = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m           = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }

      [32m+[0m [0mdefault_capacity_provider_strategy {
          [32m+[0m [0m[1m[0mbase[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mcapacity_provider[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mweight[0m[0m            = (known after apply)
        }

      [32m+[0m [0msetting {
          [32m+[0m [0m[1m[0mname[0m[0m  = "containerInsights"
          [32m+[0m [0m[1m[0mvalue[0m[0m = "enabled"
        }
    }

[1m  # module.serverless_jenkins.aws_ecs_service.jenkins_controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecs_service" "jenkins_controller" {
      [32m+[0m [0m[1m[0mcluster[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mdeployment_maximum_percent[0m[0m         = 100
      [32m+[0m [0m[1m[0mdeployment_minimum_healthy_percent[0m[0m = 0
      [32m+[0m [0m[1m[0mdesired_count[0m[0m                      = 1
      [32m+[0m [0m[1m[0menable_ecs_managed_tags[0m[0m            = false
      [32m+[0m [0m[1m[0menable_execute_command[0m[0m             = false
      [32m+[0m [0m[1m[0miam_role[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mlaunch_type[0m[0m                        = "FARGATE"
      [32m+[0m [0m[1m[0mname[0m[0m                               = "serverless-jenkins-controller"
      [32m+[0m [0m[1m[0mplatform_version[0m[0m                   = "1.4.0"
      [32m+[0m [0m[1m[0mscheduling_strategy[0m[0m                = "REPLICA"
      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mtask_definition[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mwait_for_steady_state[0m[0m              = false

      [32m+[0m [0mload_balancer {
          [32m+[0m [0m[1m[0mcontainer_name[0m[0m   = "serverless-jenkins-controller"
          [32m+[0m [0m[1m[0mcontainer_port[0m[0m   = 8080
          [32m+[0m [0m[1m[0mtarget_group_arn[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_configuration {
          [32m+[0m [0m[1m[0massign_public_ip[0m[0m = false
          [32m+[0m [0m[1m[0msecurity_groups[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0msubnets[0m[0m          = [
              [32m+[0m [0m"subnet-01ead1fb0854f8abc",
              [32m+[0m [0m"subnet-082823527a66dfb03",
            ]
        }

      [32m+[0m [0mservice_registries {
          [32m+[0m [0m[1m[0mport[0m[0m         = 50000
          [32m+[0m [0m[1m[0mregistry_arn[0m[0m = (known after apply)
        }
    }

[1m  # module.serverless_jenkins.aws_ecs_task_definition.jenkins_controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "jenkins_controller" {
      [32m+[0m [0m[1m[0marn[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mcontainer_definitions[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mcpu[0m[0m                      = "2048"
      [32m+[0m [0m[1m[0mexecution_role_arn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfamily[0m[0m                   = "serverless-jenkins"
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mmemory[0m[0m                   = "4096"
      [32m+[0m [0m[1m[0mnetwork_mode[0m[0m             = "awsvpc"
      [32m+[0m [0m[1m[0mrequires_compatibilities[0m[0m = [
          [32m+[0m [0m"FARGATE",
        ]
      [32m+[0m [0m[1m[0mrevision[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mskip_destroy[0m[0m             = false
      [32m+[0m [0m[1m[0mtags[0m[0m                     = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                 = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtask_role_arn[0m[0m            = (known after apply)

      [32m+[0m [0mvolume {
          [32m+[0m [0m[1m[0mname[0m[0m = "serverless-jenkins-efs"

          [32m+[0m [0mefs_volume_configuration {
              [32m+[0m [0m[1m[0mfile_system_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mroot_directory[0m[0m     = "/"
              [32m+[0m [0m[1m[0mtransit_encryption[0m[0m = "ENABLED"

              [32m+[0m [0mauthorization_config {
                  [32m+[0m [0m[1m[0maccess_point_id[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0miam[0m[0m             = "ENABLED"
                }
            }
        }
    }

[1m  # module.serverless_jenkins.aws_efs_access_point.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_access_point" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m            = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m        = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }

      [32m+[0m [0mposix_user {
          [32m+[0m [0m[1m[0mgid[0m[0m = 0
          [32m+[0m [0m[1m[0muid[0m[0m = 0
        }

      [32m+[0m [0mroot_directory {
          [32m+[0m [0m[1m[0mpath[0m[0m = "/"

          [32m+[0m [0mcreation_info {
              [32m+[0m [0m[1m[0mowner_gid[0m[0m   = 1000
              [32m+[0m [0m[1m[0mowner_uid[0m[0m   = 1000
              [32m+[0m [0m[1m[0mpermissions[0m[0m = "755"
            }
        }
    }

[1m  # module.serverless_jenkins.aws_efs_file_system.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_file_system" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_name[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mcreation_token[0m[0m          = "serverless-jenkins-fs"
      [32m+[0m [0m[1m[0mdns_name[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mencrypted[0m[0m               = true
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mnumber_of_mount_targets[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mperformance_mode[0m[0m        = "generalPurpose"
      [32m+[0m [0m[1m[0msize_in_bytes[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mthroughput_mode[0m[0m         = "bursting"

      [32m+[0m [0mlifecycle_policy {
          [32m+[0m [0m[1m[0mtransition_to_ia[0m[0m = "AFTER_14_DAYS"
        }
    }

[1m  # module.serverless_jenkins.aws_efs_file_system_policy.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_file_system_policy" "this" {
      [32m+[0m [0m[1m[0mbypass_policy_lockout_safety_check[0m[0m = false
      [32m+[0m [0m[1m[0mfile_system_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                             = (known after apply)
    }

[1m  # module.serverless_jenkins.aws_efs_mount_target.this["subnet-01ead1fb0854f8abc"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "this" {
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdns_name[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_arn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mmount_target_dns_name[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m              = "subnet-01ead1fb0854f8abc"
    }

[1m  # module.serverless_jenkins.aws_efs_mount_target.this["subnet-082823527a66dfb03"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "this" {
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdns_name[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_arn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mmount_target_dns_name[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m              = "subnet-082823527a66dfb03"
    }

[1m  # module.serverless_jenkins.aws_iam_policy.ecs_execution_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy" "ecs_execution_policy" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "serverless-jenkins-ecs-execution-policy"
      [32m+[0m [0m[1m[0mpath[0m[0m      = "/"
      [32m+[0m [0m[1m[0mpolicy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"logs:PutLogEvents",
                          [32m+[0m [0m"logs:CreateLogStream",
                          [32m+[0m [0m"logs:CreateLogGroup",
                          [32m+[0m [0m"ecr:GetDownloadUrlForLayer",
                          [32m+[0m [0m"ecr:GetAuthorizationToken",
                          [32m+[0m [0m"ecr:BatchGetImage",
                          [32m+[0m [0m"ecr:BatchCheckLayerAvailability",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                      [32m+[0m [0mSid      = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mpolicy_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m  = (known after apply)
    }

[1m  # module.serverless_jenkins.aws_iam_policy.jenkins_controller_task_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy" "jenkins_controller_task_policy" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "serverless-jenkins-controller-task-policy"
      [32m+[0m [0m[1m[0mpath[0m[0m      = "/"
      [32m+[0m [0m[1m[0mpolicy[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m  = (known after apply)
    }

[1m  # module.serverless_jenkins.aws_iam_role.ecs_execution_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "ecs_execution_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "ecs-tasks.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "serverless-jenkins-ecs-execution-role"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags[0m[0m                  = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # module.serverless_jenkins.aws_iam_role.jenkins_controller_task_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "jenkins_controller_task_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "ecs-tasks.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "serverless-jenkins-controller-task-role"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags[0m[0m                  = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # module.serverless_jenkins.aws_iam_role_policy_attachment.ecs_execution[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs_execution" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m       = "serverless-jenkins-ecs-execution-role"
    }

[1m  # module.serverless_jenkins.aws_iam_role_policy_attachment.jenkins_controller_task[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "jenkins_controller_task" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m       = "serverless-jenkins-controller-task-role"
    }

[1m  # module.serverless_jenkins.aws_kms_key.cloudwatch[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_kms_key" "cloudwatch" {
      [32m+[0m [0m[1m[0marn[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mbypass_policy_lockout_safety_check[0m[0m = false
      [32m+[0m [0m[1m[0mcustomer_master_key_spec[0m[0m           = "SYMMETRIC_DEFAULT"
      [32m+[0m [0m[1m[0mdescription[0m[0m                        = "KMS for cloudwatch log group"
      [32m+[0m [0m[1m[0menable_key_rotation[0m[0m                = false
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mis_enabled[0m[0m                         = true
      [32m+[0m [0m[1m[0mkey_id[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mkey_usage[0m[0m                          = "ENCRYPT_DECRYPT"
      [32m+[0m [0m[1m[0mmulti_region[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                             = jsonencode(
            {
              [32m+[0m [0mId        = "key-policy-cloudwatch"
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "kms:*"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mAWS = "arn:aws:iam::212329472425:root"
                        }
                      [32m+[0m [0mResource  = "*"
                      [32m+[0m [0mSid       = "Enable IAM User Permissions"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"kms:ReEncrypt*",
                          [32m+[0m [0m"kms:GenerateDataKey*",
                          [32m+[0m [0m"kms:Encrypt*",
                          [32m+[0m [0m"kms:Describe*",
                          [32m+[0m [0m"kms:Decrypt*",
                        ]
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "logs.us-west-2.amazonaws.com"
                        }
                      [32m+[0m [0mResource  = "*"
                      [32m+[0m [0mSid       = "AllowCloudWatchLogs"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = (known after apply)
    }

[1m  # module.serverless_jenkins.aws_lb.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lb" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0marn_suffix[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdesync_mitigation_mode[0m[0m     = "defensive"
      [32m+[0m [0m[1m[0mdns_name[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mdrop_invalid_header_fields[0m[0m = false
      [32m+[0m [0m[1m[0menable_deletion_protection[0m[0m = false
      [32m+[0m [0m[1m[0menable_http2[0m[0m               = true
      [32m+[0m [0m[1m[0menable_waf_fail_open[0m[0m       = false
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout[0m[0m               = 60
      [32m+[0m [0m[1m[0minternal[0m[0m                   = false
      [32m+[0m [0m[1m[0mip_address_type[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mload_balancer_type[0m[0m         = "application"
      [32m+[0m [0m[1m[0mname[0m[0m                       = "serverless-jenkins-crtl-alb"
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msubnets[0m[0m                    = [
          [32m+[0m [0m"subnet-01ea73f369a51bcd5",
          [32m+[0m [0m"subnet-04e026aa71cda0f0f",
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m                       = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                   = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mzone_id[0m[0m                    = (known after apply)

      [32m+[0m [0msubnet_mapping {
          [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0moutpost_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ipv4_address[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
        }
    }

[1m  # module.serverless_jenkins.aws_lb_listener.http[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lb_listener" "http" {
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mload_balancer_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m              = 80
      [32m+[0m [0m[1m[0mprotocol[0m[0m          = "HTTP"
      [32m+[0m [0m[1m[0mssl_policy[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m          = (known after apply)

      [32m+[0m [0mdefault_action {
          [32m+[0m [0m[1m[0morder[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = "redirect"

          [32m+[0m [0mredirect {
              [32m+[0m [0m[1m[0mhost[0m[0m        = "#{host}"
              [32m+[0m [0m[1m[0mpath[0m[0m        = "/#{path}"
              [32m+[0m [0m[1m[0mport[0m[0m        = "443"
              [32m+[0m [0m[1m[0mprotocol[0m[0m    = "HTTPS"
              [32m+[0m [0m[1m[0mquery[0m[0m       = "#{query}"
              [32m+[0m [0m[1m[0mstatus_code[0m[0m = "HTTP_301"
            }
        }
    }

[1m  # module.serverless_jenkins.aws_lb_listener.https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lb_listener" "https" {
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_arn[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mload_balancer_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m              = 443
      [32m+[0m [0m[1m[0mprotocol[0m[0m          = "HTTPS"
      [32m+[0m [0m[1m[0mssl_policy[0m[0m        = "ELBSecurityPolicy-FS-1-2-Res-2019-08"
      [32m+[0m [0m[1m[0mtags_all[0m[0m          = (known after apply)

      [32m+[0m [0mdefault_action {
          [32m+[0m [0m[1m[0morder[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mtarget_group_arn[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m             = "forward"
        }
    }

[1m  # module.serverless_jenkins.aws_lb_listener_rule.redirect_http_to_https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lb_listener_rule" "redirect_http_to_https" {
      [32m+[0m [0m[1m[0marn[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mlistener_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m     = (known after apply)

      [32m+[0m [0maction {
          [32m+[0m [0m[1m[0morder[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = "redirect"

          [32m+[0m [0mredirect {
              [32m+[0m [0m[1m[0mhost[0m[0m        = "#{host}"
              [32m+[0m [0m[1m[0mpath[0m[0m        = "/#{path}"
              [32m+[0m [0m[1m[0mport[0m[0m        = "443"
              [32m+[0m [0m[1m[0mprotocol[0m[0m    = "HTTPS"
              [32m+[0m [0m[1m[0mquery[0m[0m       = "#{query}"
              [32m+[0m [0m[1m[0mstatus_code[0m[0m = "HTTP_301"
            }
        }

      [32m+[0m [0mcondition {

          [32m+[0m [0mhttp_header {
              [32m+[0m [0m[1m[0mhttp_header_name[0m[0m = "*"
              [32m+[0m [0m[1m[0mvalues[0m[0m           = [
                  [32m+[0m [0m"*",
                ]
            }
        }
    }

[1m  # module.serverless_jenkins.aws_lb_target_group.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_lb_target_group" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0marn_suffix[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mconnection_termination[0m[0m             = false
      [32m+[0m [0m[1m[0mderegistration_delay[0m[0m               = "300"
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mlambda_multi_value_headers_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mload_balancing_algorithm_type[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                               = "serverless-jenkins-crtl"
      [32m+[0m [0m[1m[0mport[0m[0m                               = 8080
      [32m+[0m [0m[1m[0mpreserve_client_ip[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                           = "HTTP"
      [32m+[0m [0m[1m[0mprotocol_version[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mproxy_protocol_v2[0m[0m                  = false
      [32m+[0m [0m[1m[0mslow_start[0m[0m                         = 0
      [32m+[0m [0m[1m[0mtags[0m[0m                               = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtarget_type[0m[0m                        = "ip"
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                             = "vpc-4ff8bc37"

      [32m+[0m [0mhealth_check {
          [32m+[0m [0m[1m[0menabled[0m[0m             = true
          [32m+[0m [0m[1m[0mhealthy_threshold[0m[0m   = 3
          [32m+[0m [0m[1m[0minterval[0m[0m            = 30
          [32m+[0m [0m[1m[0mmatcher[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mpath[0m[0m                = "/login"
          [32m+[0m [0m[1m[0mport[0m[0m                = "traffic-port"
          [32m+[0m [0m[1m[0mprotocol[0m[0m            = "HTTP"
          [32m+[0m [0m[1m[0mtimeout[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0munhealthy_threshold[0m[0m = 3
        }

      [32m+[0m [0mstickiness {
          [32m+[0m [0m[1m[0mcookie_duration[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mcookie_name[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m            = (known after apply)
        }
    }

[1m  # module.serverless_jenkins.aws_route53_record.this[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_record" "this" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "jenkins-controller"
      [32m+[0m [0m[1m[0mtype[0m[0m            = "A"
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "Z08283091JJ6X8ITV69S6"

      [32m+[0m [0malias {
          [32m+[0m [0m[1m[0mevaluate_target_health[0m[0m = true
          [32m+[0m [0m[1m[0mname[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mzone_id[0m[0m                = (known after apply)
        }
    }

[1m  # module.serverless_jenkins.aws_security_group.alb_security_group[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "alb_security_group" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "serverless-jenkins alb security group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"18.116.81.193/32",
                ]
              [32m+[0m [0mdescription      = "HTTP Public access"
              [32m+[0m [0mfrom_port        = 80
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 80
            },
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"18.116.81.193/32",
                ]
              [32m+[0m [0mdescription      = "HTTPS Public access"
              [32m+[0m [0mfrom_port        = 443
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 443
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "serverless-jenkins-alb"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = "vpc-4ff8bc37"
    }

[1m  # module.serverless_jenkins.aws_security_group.efs_security_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "efs_security_group" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "serverless-jenkins efs security group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = []
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 2049
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = (known after apply)
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 2049
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "serverless-jenkins-efs"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = "vpc-4ff8bc37"
    }

[1m  # module.serverless_jenkins.aws_security_group.jenkins_controller_security_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "jenkins_controller_security_group" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "serverless-jenkins controller security group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = []
              [32m+[0m [0mdescription      = "Communication channel to jenkins leader"
              [32m+[0m [0mfrom_port        = 50000
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = (known after apply)
              [32m+[0m [0mself             = true
              [32m+[0m [0mto_port          = 50000
            },
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = []
              [32m+[0m [0mdescription      = "Communication channel to jenkins leader"
              [32m+[0m [0mfrom_port        = 8080
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = (known after apply)
              [32m+[0m [0mself             = true
              [32m+[0m [0mto_port          = 8080
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "serverless-jenkins-controller"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"solution" = "jenkins"
          [32m+[0m [0m"team"     = "devops"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = "vpc-4ff8bc37"
    }

[1m  # module.serverless_jenkins.aws_service_discovery_private_dns_namespace.controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_service_discovery_private_dns_namespace" "controller" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Serverless Jenkins discovery managed zone."
      [32m+[0m [0m[1m[0mhosted_zone[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "serverless-jenkins"
      [32m+[0m [0m[1m[0mtags_all[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mvpc[0m[0m         = "vpc-4ff8bc37"
    }

[1m  # module.serverless_jenkins.aws_service_discovery_service.controller[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_service_discovery_service" "controller" {
      [32m+[0m [0m[1m[0marn[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m          = "controller"
      [32m+[0m [0m[1m[0mnamespace_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m      = (known after apply)

      [32m+[0m [0mdns_config {
          [32m+[0m [0m[1m[0mnamespace_id[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mrouting_policy[0m[0m = "MULTIVALUE"

          [32m+[0m [0mdns_records {
              [32m+[0m [0m[1m[0mttl[0m[0m  = 10
              [32m+[0m [0m[1m[0mtype[0m[0m = "A"
            }
          [32m+[0m [0mdns_records {
              [32m+[0m [0m[1m[0mttl[0m[0m  = 10
              [32m+[0m [0m[1m[0mtype[0m[0m = "SRV"
            }
        }

      [32m+[0m [0mhealth_check_custom_config {
          [32m+[0m [0m[1m[0mfailure_threshold[0m[0m = 5
        }
    }

[1m  # module.serverless_jenkins.null_resource.build_docker_image[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "null_resource" "build_docker_image" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mtriggers[0m[0m = {
          [32m+[0m [0m"src_hash" = <<-EOT
                jenkins:
                    systemMessage: "Amazon Fargate Demo"
                    numExecutors: 0
                    remotingSecurity:
                      enabled: true
                    agentProtocols:
                        - "JNLP4-connect"
                    securityRealm:
                        local:
                            allowsSignup: false
                            users:
                                - id: ecsuser
                                  password: \$${ADMIN_PWD}
                    authorizationStrategy:
                        globalMatrix:
                            grantedPermissions:
                                - "Overall/Read:authenticated"
                                - "Job/Read:authenticated"
                                - "View/Read:authenticated"
                                - "Overall/Administer:authenticated"
                    crumbIssuer: "standard"
                    slaveAgentPort: 50000
                    clouds:
                        # - ecs:
                        #       allowedOverrides: "inheritFrom,label,memory,cpu,image"
                        #       credentialsId: ""
                        #       cluster: ${ecs_cluster_fargate_spot}
                        #       name: "fargate-cloud-spot"
                        #       regionName: ${cluster_region}
                        #       retentionTimeout: 10
                        #       jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                        #       templates:
                        #           - cpu: "512"
                        #             image: "jenkins/inbound-agent"
                        #             label: "build-spot"
                        #             executionRole: ${execution_role_arn}
                        #             launchType: "FARGATE"
                        #             memory: 0
                        #             memoryReservation: 1024
                        #             networkMode: "awsvpc"
                        #             privileged: false
                        #             remoteFSRoot: "/home/jenkins"
                        #             securityGroups: ${agent_security_groups}
                        #             sharedMemorySize: 0
                        #             subnets: ${subnets}
                        #             templateName: "build"
                        #             uniqueRemoteFSRoot: false
                        - ecs:
                              allowedOverrides: "inheritFrom,label,memory,cpu,image"
                              credentialsId: ""
                              cluster: ${ecs_cluster_fargate}
                              name: "fargate-cloud"
                              regionName: ${cluster_region}
                              retentionTimeout: 10
                              jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                              templates:
                                  - cpu: "512"
                                    image: "jenkins/inbound-agent"
                                    label: "build"
                                    executionRole: ${execution_role_arn}
                                    launchType: "FARGATE"
                                    memory: 0
                                    memoryReservation: 1024
                                    networkMode: "awsvpc"
                                    privileged: false
                                    remoteFSRoot: "/home/jenkins"
                                    securityGroups: ${agent_security_groups}
                                    sharedMemorySize: 0
                                    subnets: ${subnets}
                                    templateName: "build"
                                    uniqueRemoteFSRoot: false
                security:
                  sSHD:
                    port: -1
                jobs:
                  - script: >
                      pipelineJob('Simple job critical task') {
                        definition {
                          cps {
                            script('''
                              pipeline {
                                  agent {
                                      ecs {
                                          inheritFrom 'build'
                                      }
                                  }
                                  stages {
                                    stage('Test') {
                                        steps {
                                            script {
                                                sh "echo this was executed on non spot instance"
                                            }
                                            sh 'sleep 120'
                                            sh 'echo sleep is done'
                                        }
                                    }
                                  }
                              }'''.stripIndent())
                              sandbox()
                          }
                        }
                      }
                  # - script: >
                  #     pipelineJob('Simple job non critical task') {
                  #       definition {
                  #         cps {
                  #           script('''
                  #             pipeline {
                  #                 agent {
                  #                     ecs {
                  #                         inheritFrom 'build-spot'
                  #                     }
                  #                 }
                  #                 stages {
                  #                   stage('Test') {
                  #                       steps {
                  #                           script {
                  #                               sh "echo this was executed on a spot instance"
                  #                           }
                  #                           sh 'sleep 120'
                  #                           sh 'echo sleep is done'
                  #                       }
                  #                   }
                  #                 }
                  #             }'''.stripIndent())
                  #             sandbox()
                  #         }
                  #       }
                  #     }
            EOT
        }
    }

[1m  # module.serverless_jenkins.null_resource.render_template[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "null_resource" "render_template" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mtriggers[0m[0m = {
          [32m+[0m [0m"src_hash" = <<-EOT
                jenkins:
                    systemMessage: "Amazon Fargate Demo"
                    numExecutors: 0
                    remotingSecurity:
                      enabled: true
                    agentProtocols:
                        - "JNLP4-connect"
                    securityRealm:
                        local:
                            allowsSignup: false
                            users:
                                - id: ecsuser
                                  password: \$${ADMIN_PWD}
                    authorizationStrategy:
                        globalMatrix:
                            grantedPermissions:
                                - "Overall/Read:authenticated"
                                - "Job/Read:authenticated"
                                - "View/Read:authenticated"
                                - "Overall/Administer:authenticated"
                    crumbIssuer: "standard"
                    slaveAgentPort: 50000
                    clouds:
                        # - ecs:
                        #       allowedOverrides: "inheritFrom,label,memory,cpu,image"
                        #       credentialsId: ""
                        #       cluster: ${ecs_cluster_fargate_spot}
                        #       name: "fargate-cloud-spot"
                        #       regionName: ${cluster_region}
                        #       retentionTimeout: 10
                        #       jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                        #       templates:
                        #           - cpu: "512"
                        #             image: "jenkins/inbound-agent"
                        #             label: "build-spot"
                        #             executionRole: ${execution_role_arn}
                        #             launchType: "FARGATE"
                        #             memory: 0
                        #             memoryReservation: 1024
                        #             networkMode: "awsvpc"
                        #             privileged: false
                        #             remoteFSRoot: "/home/jenkins"
                        #             securityGroups: ${agent_security_groups}
                        #             sharedMemorySize: 0
                        #             subnets: ${subnets}
                        #             templateName: "build"
                        #             uniqueRemoteFSRoot: false
                        - ecs:
                              allowedOverrides: "inheritFrom,label,memory,cpu,image"
                              credentialsId: ""
                              cluster: ${ecs_cluster_fargate}
                              name: "fargate-cloud"
                              regionName: ${cluster_region}
                              retentionTimeout: 10
                              jenkinsUrl: "http://${jenkins_cloud_map_name}:${jenkins_controller_port}"
                              templates:
                                  - cpu: "512"
                                    image: "jenkins/inbound-agent"
                                    label: "build"
                                    executionRole: ${execution_role_arn}
                                    launchType: "FARGATE"
                                    memory: 0
                                    memoryReservation: 1024
                                    networkMode: "awsvpc"
                                    privileged: false
                                    remoteFSRoot: "/home/jenkins"
                                    securityGroups: ${agent_security_groups}
                                    sharedMemorySize: 0
                                    subnets: ${subnets}
                                    templateName: "build"
                                    uniqueRemoteFSRoot: false
                security:
                  sSHD:
                    port: -1
                jobs:
                  - script: >
                      pipelineJob('Simple job critical task') {
                        definition {
                          cps {
                            script('''
                              pipeline {
                                  agent {
                                      ecs {
                                          inheritFrom 'build'
                                      }
                                  }
                                  stages {
                                    stage('Test') {
                                        steps {
                                            script {
                                                sh "echo this was executed on non spot instance"
                                            }
                                            sh 'sleep 120'
                                            sh 'echo sleep is done'
                                        }
                                    }
                                  }
                              }'''.stripIndent())
                              sandbox()
                          }
                        }
                      }
                  # - script: >
                  #     pipelineJob('Simple job non critical task') {
                  #       definition {
                  #         cps {
                  #           script('''
                  #             pipeline {
                  #                 agent {
                  #                     ecs {
                  #                         inheritFrom 'build-spot'
                  #                     }
                  #                 }
                  #                 stages {
                  #                   stage('Test') {
                  #                       steps {
                  #                           script {
                  #                               sh "echo this was executed on a spot instance"
                  #                           }
                  #                           sh 'sleep 120'
                  #                           sh 'echo sleep is done'
                  #                       }
                  #                   }
                  #                 }
                  #             }'''.stripIndent())
                  #             sandbox()
                  #         }
                  #       }
                  #     }
            EOT
        }
    }

[0m[1mPlan:[0m 35 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mjenkins_fargate_efs[0m[0m = {
      [32m+[0m [0mefs_access_point_id       = (known after apply)
      [32m+[0m [0mefs_aws_backup_plan_name  = []
      [32m+[0m [0mefs_aws_backup_vault_name = []
      [32m+[0m [0mefs_file_system_dns_name  = (known after apply)
      [32m+[0m [0mefs_file_system_id        = (known after apply)
      [32m+[0m [0mefs_security_group_id     = (known after apply)
    }
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.serverless_jenkins.aws_ecs_cluster.jenkins_controller,
[33m│[0m [0m  on modules/jenkins/ecs.tf line 4, in resource "aws_ecs_cluster" "jenkins_controller":
[33m│[0m [0m   4:   capacity_providers = [4m["FARGATE"][0m[0m
[33m│[0m [0m
[33m│[0m [0mUse the aws_ecs_cluster_capacity_providers resource instead
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 10 estimated
           $18.74000000000000544/mo +$18.74000000000000544

```

</details>

*Pusher: @goudhabuddha, Action: `pull_request`*